mixly/Mixly_Company_Extend/lubot/hardware/lubot/avr/boards.txt
LuBotMK.name=LuBotMK

LuBotMK.vid.0=0x2341
LuBotMK.pid.0=0x0043
LuBotMK.vid.1=0x2341
LuBotMK.pid.1=0x0001
LuBotMK.vid.2=0x2A03
LuBotMK.pid.2=0x0043
LuBotMK.vid.3=0x2341
LuBotMK.pid.3=0x0243

LuBotMK.upload.tool=avrdude
LuBotMK.upload.protocol=arduino
LuBotMK.upload.maximum_size=32256
LuBotMK.upload.maximum_data_size=2048
LuBotMK.upload.speed=115200

LuBotMK.bootloader.tool=avrdude
LuBotMK.bootloader.low_fuses=0xFF
LuBotMK.bootloader.high_fuses=0xDE
LuBotMK.bootloader.extended_fuses=0xFD
LuBotMK.bootloader.unlock_bits=0x3F
LuBotMK.bootloader.lock_bits=0x0F
LuBotMK.bootloader.file=optiboot/optiboot_atmega328.hex

LuBotMK.build.mcu=atmega328p
LuBotMK.build.f_cpu=16000000L
LuBotMK.build.board=AVR_UNO
LuBotMK.build.core=arduino
LuBotMK.build.variant=lubotmk
LuBotMK.build.variant=lubotmk